#+SEQ_TODO: TODO INPROGRESS DONE

* Programming 
** INPROGRESS Learn more emacs keybinds, etc		     :emacs:programming:
** INPROGRESS Learn org-mode better			     :emacs:programming:
** INPROGRESS Learn Python!				    :python:programming:
** TODO Learn about bloom filters 			:algorithms:programming:

** TODO Golomb coding 			    :algorithms:compression:programming:
** TODO Read "The Pragmatic Programmer" 			   :programming:
** TODO Read all my other books that I have saved 		   :programming:
* Work
** INPROGRESS Incorporate CMake into BEF plugin			:work:bef:cmake:
   DEADLINE: <2009-05-31 Sun>
** INPROGRESS Finish prototype of Photoshop Filters plugin :work:plugin:monarch:
   DEADLINE: <2009-05-29 Fri>
*** INPROGRESS Plug-in integration
    This is almost done, just need to add some more basic boilerplate code.
*** DONE Make a superficial UI
    OK, Cancel, image display, and dynamically populated pane that
    takes a bunch of scroll bars and buttons, basically, whatever is
    needed for the transformation
*** DONE Create design for base classes/factories for retrieving filters
    DEADLINE: <2009-05-22 Fri>
    Created _filter_factory, _filter_base, _brightness_filter, still need to
    add the rest of the filters. Still need to test functionality. Hmm, looks
    like there's no real need to do this, just use the classes already there.
    Then again, the base class interfaces may not work for them.
    
*** DONE Image resizing to miniature
    Image needs to be resized to about 1.5 megapixel image - this image
    will be the one that all operations will be done on
*** DONE Rendering the miniature inside Photoshop
    The miniature should be rendered using some internal Photoshop API
    that is used to draw graphics inside of a dialogue
*** TODO Image transformation
    Image transformations will simply be the functions that are provided
    by kwelib
*** TODO Converting BEF back to sRGB
    Use kwe::cmss::colorspace class in order to do these transforms
*** DONE Rendering sRGB
    This is already addressed by image transformation
*** INPROGRESS User interface event code
    This will be somewhat copied from UCT Studio's dialogue event code,
    however, I'm going to see if it'll be possible to use a platform-
    indepedent library like Qt here, so that the code can be written just
    once for both Mac and PC. ADM Dialogs code is also an
    option.
*** TODO White Balance operation
*** TODO Color Tuning operation
*** TODO Saturation operation
** TODO Weekly meeting							  :work:
   <2009-05-18 Mon 23:00 +1w>
   <2009-05-18 Mon 23:00-00:20>
** TODO Read up on multithreading			   :work:hdrphotostudio:
** TODO Add progress bar to BEF Plug-in 		       :work:plugin:bef:
** TODO Add usage of swap files to BEF plug-in 		       :work:plugin:bef:
** TODO Fix Mac version of plug-in 			   :work:plugin:bef:mac:
   DEADLINE: <2009-05-29 Fri 17:00>

** TODO Add dialog to Mac version of plug-in 		   :work:plugin:bef:mac:
   DEADLINE: <2009-05-29 Fri 17:00>

** TODO Talk to Nikita about image validation 			   :work:kwelib:
   DEADLINE: <2009-05-28 Thu 23:00>

* Fitness
** INPROGRESS Play more tennis			      :sports:fitness:clubsport:
   <2009-05-18 Mon 21:00-22:30>
** TODO Start workout regimen 				     :fitness:clubsport:
** INPROGRESS Start going to club sport more often	     :fitness:clubsport:
** TODO Find out why the hell Club Sport charged me $200     :fitness:clubsport:
** TODO Start running 						       :fitness:
* General
** TODO Create plan of what to do in Moscow		 :moscow:travel:general:
   DEADLINE: <2009-07-08 Wed>
** TODO Flight: SFO -> France -> Russia 			:general:moscow:
   <2009-07-09 Thu 15:30>
** TODO Flight: Russia -> Amsterdam -> SFO 			:general:moscow:
   <2009-08-12 Wed 11:10>
** TODO Call Fastrak about tickets 			:general:finance:ticket:
   DEADLINE: <2009-05-29 Fri>
** TODO Read up more about fighting speeding tickets 		:general:ticket:
** TODO Answer trafic court letter 				:general:ticket:
   DEADLINE: <2009-06-13 Sat>
** TODO Davis 						:general:friends:travel:
<2009-06-06 Sat>
** TODO Haircut :general:
<2009-06-12 Fri 11:15>
* TV
** INPROGRESS Weeds							    :tv:
   <2009-06-08 Mon>   
** TODO Dexter 								    :tv:
   <2009-10-01 Thu>
** TODO Zeitgeist: Addendum 						    :tv:
* Expenses
| Date             | Item                  | Cost (USD) |
|------------------+-----------------------+------------|
| <2009-05-18 Mon> | Lunch at Zorba's      |      10.00 |
| <2009-05-18 Mon> | Dinner at Chipotle    |       7.80 |
| <2009-05-18 Mon> | Loan repayment to mom |     300.00 |
| <2009-05-18 Mon> | Food at Denny's       |      10.00 |
| <2009-05-19 Tue> | Food + Coffee         |       17.8 |
| <2009-05-20 Wed> | Coffee                |       3.80 |
| <2009-05-20 Wed> | Subway                |       2.80 |
| <2009-05-20 Wed> | Energy drink          |       3.40 |
| <2009-05-20 Wed> | In-n-out              |       2.80 |
|------------------+-----------------------+------------|
|                  | Total amount          |     358.40 |
#+TBLFM: $3=vsum(@2..@10);%.2f    349.40
